% ΕΡΩΤΗΜΑ 1
disp('================ ΕΡΩΤΗΜΑ 1 ================');
A1 = [10 -2 -1 2 3 1 -4 7;
     5 11 3 10 -3 3 3 -4;
     7 12 1 5 3 -12 2 3;
     8 7 -2 1 3 2 2 4;
     2 -13 -1 1 4 -1 8 3;
     4 2 9 1 12 -1 4 1;
     -1 4 -7 -1 1 1 -1 -3;
     -1 3 4 1 3 -4 7 6];

x_exact = [-1 1 -1 1 -1 1 -1 1]';
b1 = A1 * x_exact;

% Κλήση της συνάρτησης για το 1ο σύστημα
[x1, A1_inv, dx1, dr1, cond1] = pivot_gaussjordan(A1, b1, x_exact);

disp('Λύση συστήματος x:');
disp(x1);
disp('Αντίστροφος πίνακας A^-1 (υπολογισμένος με μέθοδο Jordan):');
disp(A1_inv);
fprintf('Σφάλμα ||δx||_inf: %e\n', dx1);
fprintf('Υπόλοιπο ||δr||_inf: %e\n', dr1);
fprintf('Αριθμός συνθήκης κ(A): %e\n\n', cond1);

% ΕΡΩΤΗΜΑ 2
disp('================ ΕΡΩΤΗΜΑ 2 ================');
n = 8;
A2 = zeros(n, n);
for i = 1:n
    for j = 1:n
        A2(i, j) = 1 / (i + j - 1); % Πίνακας Hilbert
    end
end
b2 = A2 * x_exact;

% Κλήση της συνάρτησης για το 2ο σύστημα
[x2, A2_inv, dx2, dr2, cond2] = pivot_gaussjordan(A2, b2, x_exact);

disp('Λύση συστήματος y:');
disp(x2);
fprintf('Σφάλμα ||δx||_inf: %e\n', dx2);
fprintf('Υπόλοιπο ||δr||_inf: %e\n', dr2);
fprintf('Αριθμός συνθήκης κ(A): %e\n\n', cond2);